app/service/transaction/mutations.rb

    def perform(current_user, account_id)
      account = Account.find(account_id)
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1