app/service/transaction/transfer.rb

INSERT INTO `transactions` (`user_id`, `deposit_id`, `withdrawal_id`, `source_account_id`, `destination_account_id`, `state`, `amount`, `succeeded_at`, `failed_at`, `message`, `created_at`, `updated_at`) VALUES (1, 7, 7, 1, 2, 2, 400.0, NULL, NULL, 'success', '2024-09-10 16:00:49.868267', '2024-09-10 16:00:49.868267')
---
    def perform(current_user, payload)
      ActiveRecord::Base.transaction do
        @current_user = current_user
        @source_account = validate_source_account(payload)
        @destination_account = validate_destination_account(payload)

        @transaction = Transaction.new(
          user_id: @current_user.id,
          source_account_id: @source_account.id,
          destination_account_id: @destination_account.id,
          state: Constants::TransactionState::CREATED,
          amount: payload.amount
        )
        execute_transfer
        @transaction.save!

INSERT INTO `transactions` (`deposit_id`, `withdrawal_id`, `source_account_id`, `destination_account_id`, `state`, `amount`, `succeeded_at`, `failed_at`, `message`, `created_at`, `updated_at`, `user_id`) VALUES (41, 61, 1, 3, 2, 400.0, NULL, NULL, 'success', '2024-09-09 15:49:42.267005', '2024-09-09 15:49:42.267005', NULL)
INSERT INTO `withdrawals` (`account_id`, `amount`, `created_at`, `updated_at`) VALUES (1, 400.0, '2024-09-10 16:00:49.855728', '2024-09-10 16:00:49.855728')
INSERT INTO `withdrawals` (`account_id`, `amount`, `created_at`, `updated_at`) VALUES (1, 400.0, '2024-09-09 15:49:42.259574', '2024-09-09 15:49:42.259574')
INSERT INTO `deposits` (`account_id`, `amount`, `created_at`, `updated_at`) VALUES (2, 400.0, '2024-09-10 16:00:49.865782', '2024-09-10 16:00:49.865782')
---
    def execute_transfer
      ActiveRecord::Base.transaction do
        withdrawal = Withdrawal.create(account_id: @source_account.id, amount: @transaction.amount)
        unless ENV["MAX_DEPOSIT"].blank?
          raise Errors::TransactionLimitError if @transaction.amount > ENV["MAX_DEPOSIT"].to_f
        end
        deposit = Deposit.create(account_id: @destination_account.id, amount: @transaction.amount)

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`account_number` = '0063515001736587' LIMIT 1
---
    def validate_destination_account(payload)
      if payload.source_account == payload.destination_account
        raise Errors::InvalidDestinationError
      end
      account = Account.find_by_account_number(payload.destination_account)

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`account_number` = '0212677229570542' LIMIT 1
---
    def validate_source_account(payload)
      account = Account.find_by_account_number(payload.source_account)