app/controllers/accounts_controller.rb

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`user_id` = 2 LIMIT 1
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`user_id` = 2
---
  def index
    accounts = Account.where(user_id: @current_user.id)
    serialized_accounts = []
    accounts.each do |account|