app/controllers/session_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'farid' LIMIT 1
UPDATE `users` SET `users`.`token` = 'eyJ1c2VyX2lkIjoyLCJleHBpcmVkIjoxNzI1Nzk3NzUxNzkzfQ==.a68872d0efef64ee0857b8d1c02d93f7c4cae053a71992212a041152945c4fac', `users`.`updated_at` = '2024-09-08 12:15:51.794224' WHERE `users`.`id` = 2
---
  def login
    begin
      user = User.find_by(username: params[:username])
      encrypted_password = Encryptor.encrypt(params[:password], user.secret)
      if encrypted_password != user.crypted_password
        raise Errors::UnauthorizedError
      end

      token = AccessToken.new(user.id)
      access_token = token.generate(user.secret)
      user.token = access_token
      user.save!