app/controllers/transactions_controller.rb

  def index
    transactions = Transaction.where(user_id: current_user.id)
    serialized_transactions = []
    transactions.each do |trx|
---
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`user_id` = 2

  def show
    transaction = Transaction.find_by(id: params[:id], user_id: current_user.id)
---
SELECT `transactions`.* FROM `transactions` WHERE `transactions`.`id` = 2 AND `transactions`.`user_id` = 1 LIMIT 1