app/models/account.rb

  def balance
    debits = self.withdrawals.sum(:amount)
    credits = self.deposits.sum(:amount)
---
SELECT SUM(`withdrawals`.`amount`) FROM `withdrawals` WHERE `withdrawals`.`account_id` = 1
SELECT SUM(`deposits`.`amount`) FROM `deposits` WHERE `deposits`.`account_id` = 1