app/models/transaction.rb

SELECT `transactions`.* FROM `transactions` WHERE (`transactions`.`source_account_id` = 1 OR `transactions`.`destination_account_id` = 1) AND `transactions`.`state` = 2 ORDER BY `transactions`.`created_at` DESC
---
    def mutations(account_id)
      self.where(source_account: account_id).
        or(self.where(destination_account: account_id)).
        and(self.where(state: Constants::TransactionState::SUCCEEDED)).order(created_at: "DESC")