app/controllers/concerns/token.rb

  def authorize(token)
    begin
      token_values = token.split(".")
      decoded_token = Base64.strict_decode64(token_values[0])
      token_user = JSON.parse(decoded_token).deep_symbolize_keys
      user = User.find(token_user[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1